haliwt/MKV44F128VLH16_Soft/fsl_drivers/fsl_clock.h
/*! @brief Clock ip name array for PDB. */
#define PDB_CLOCKS               \
    {                            \
        kCLOCK_Pdb0, kCLOCK_Pdb1 \
    }

/*! @brief Clock ip name array for CMP. */
#define CMP_CLOCKS                                         \
    {                                                      \
        kCLOCK_Cmp0, kCLOCK_Cmp1, kCLOCK_Cmp2, kCLOCK_Cmp3 \
    }

/*! @brief Clock ip name array for FTF. */
#define FTF_CLOCKS  \
    {               \
        kCLOCK_Ftf0 \
    }

/*!
 * @brief LPO clock frequency.
 */
#define LPO_CLK_FREQ 1000U

/*! @brief Peripherals clock source definition. */
#define SYS_CLK kCLOCK_CoreSysClk
#define BUS_CLK kCLOCK_BusClk
#define FAST_CLK kCLOCK_FastPeriphClk

#define I2C0_CLK_SRC BUS_CLK
#define DSPI0_CLK_SRC FAST_CLK
#define UART0_CLK_SRC FAST_CLK
#define UART1_CLK_SRC FAST_CLK

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_name
{

    /* ----------------------------- System layer clock -------------------------------*/
    kCLOCK_CoreSysClk,    /*!< Core/system clock                                         */
    kCLOCK_PlatClk,       /*!< Platform clock                                            */
    kCLOCK_BusClk,        /*!< Bus clock                                                 */
    kCLOCK_FlashClk,      /*!< Flash clock                                               */
    kCLOCK_FastPeriphClk, /*!< Fast peripheral clock                                     */

    /* ---------------------------------- OSC clock -----------------------------------*/
    kCLOCK_Er32kClk,       /*!< External reference 32K clock (ERCLK32K)                   */
    kCLOCK_Osc0ErClk,      /*!< OSC0 external reference clock (OSC0ERCLK)                 */
    kCLOCK_Osc0ErClkUndiv, /*!< OSC0 external reference undivided clock(OSC0ERCLK_UNDIV). */

    /* ----------------------------- MCG and MCG-Lite clock ---------------------------*/
    kCLOCK_McgFixedFreqClk,   /*!< MCG fixed frequency clock (MCGFFCLK)                      */
    kCLOCK_McgInternalRefClk, /*!< MCG internal reference clock (MCGIRCLK)                   */
    kCLOCK_McgFllClk,         /*!< MCGFLLCLK                                                 */
    kCLOCK_McgPll0Clk,        /*!< MCGPLL0CLK                                                */
    kCLOCK_McgExtPllClk,      /*!< EXT_PLLCLK                                                */
    kCLOCK_McgPeriphClk,      /*!< MCG peripheral clock (MCGPCLK)                            */

    /* --------------------------------- Other clock ----------------------------------*/
    kCLOCK_LpoClk, /*!< LPO clock                                                 */

} clock_name_t;

/*------------------------------------------------------------------------------

 clock_gate_t definition:

 31                              16                              0
 -----------------------------------------------------------------
 | SIM_SCGC register offset       |   control bit offset in SCGC |
 -----------------------------------------------------------------

 For example, the SDHC clock gate is controlled by SIM_SCGC3[17], the
 SIM_SCGC3 offset in SIM is 0x1030, then kCLOCK_GateSdhc0 is defined as

              kCLOCK_GateSdhc0 = (0x1030 << 16) | 17;

------------------------------------------------------------------------------*/

#define CLK_GATE_REG_OFFSET_SHIFT 16U
#define CLK_GATE_REG_OFFSET_MASK 0xFFFF0000U  //
#define CLK_GATE_BIT_SHIFT_SHIFT 0U
#define CLK_GATE_BIT_SHIFT_MASK 0x0000FFFFU

#define CLK_GATE_DEFINE(reg_offset, bit_shift)                                  \
    ((((reg_offset) << CLK_GATE_REG_OFFSET_SHIFT) & CLK_GATE_REG_OFFSET_MASK) | \
     (((bit_shift) << CLK_GATE_BIT_SHIFT_SHIFT) & CLK_GATE_BIT_SHIFT_MASK))

#define CLK_GATE_ABSTRACT_REG_OFFSET(x) (((x)&CLK_GATE_REG_OFFSET_MASK) >> CLK_GATE_REG_OFFSET_SHIFT)
#define CLK_GATE_ABSTRACT_BITS_SHIFT(x) (((x)&CLK_GATE_BIT_SHIFT_MASK) >> CLK_GATE_BIT_SHIFT_SHIFT)

/*! @brief Clock gate name used for CLOCK_EnableClock/CLOCK_DisableClock. */
typedef enum _clock_ip_name
{
    kCLOCK_IpInvalid = 0U,
    kCLOCK_Ewm0      = CLK_GATE_DEFINE(0x1034U, 1U),
    kCLOCK_I2c0      = CLK_GATE_DEFINE(0x1034U, 6U),
    kCLOCK_Uart0     = CLK_GATE_DEFINE(0x1034U, 10U),
    kCLOCK_Uart1     = CLK_GATE_DEFINE(0x1034U, 11U),
    kCLOCK_Cmp0      = CLK_GATE_DEFINE(0x1034U, 19U),
    kCLOCK_Cmp1      = CLK_GATE_DEFINE(0x1034U, 19U),
    kCLOCK_Cmp2      = CLK_GATE_DEFINE(0x1034U, 19U),
    kCLOCK_Cmp3      = CLK_GATE_DEFINE(0x1034U, 19U),
    kCLOCK_Pwm0_Sm0  = CLK_GATE_DEFINE(0x1034U, 24U),
    kCLOCK_Pwm0_Sm1  = CLK_GATE_DEFINE(0x1034U, 25U),
    kCLOCK_Pwm0_Sm2  = CLK_GATE_DEFINE(0x1034U, 26U),
    kCLOCK_Pwm0_Sm3  = CLK_GATE_DEFINE(0x1034U, 27U),

    kCLOCK_Lptmr0 = CLK_GATE_DEFINE(0x1038U, 0U),
    kCLOCK_PortA  = CLK_GATE_DEFINE(0x1038U, 9U),
    kCLOCK_PortB  = CLK_GATE_DEFINE(0x1038U, 10U),
    kCLOCK_PortC  = CLK_GATE_DEFINE(0x1038U, 11U),
    kCLOCK_PortD  = CLK_GATE_DEFINE(0x1038U, 12U),  //offset 0x1038u
    kCLOCK_PortE  = CLK_GATE_DEFINE(0x1038U, 13U),
    kCLOCK_Enc0   = CLK_GATE_DEFINE(0x1038U, 21U),
    kCLOCK_XbarA  = CLK_GATE_DEFINE(0x1038U, 25U),
    kCLOCK_XbarB  = CLK_GATE_DEFINE(0x1038U, 26U),
    kCLOCK_Aoi0   = CLK_GATE_DEFINE(0x1038U, 27U),
    kCLOCK_Adc0   = CLK_GATE_DEFINE(0x1038U, 28U),

    kCLOCK_Ftf0     = CLK_GATE_DEFINE(0x103CU, 0U),
    kCLOCK_Dmamux0  = CLK_GATE_DEFINE(0x103CU, 1U),
    kCLOCK_Flexcan0 = CLK_GATE_DEFINE(0x103CU, 4U),
    kCLOCK_Flexcan1 = CLK_GATE_DEFINE(0x103CU, 5U),
    kCLOCK_Ftm3     = CLK_GATE_DEFINE(0x103CU, 6U),
    kCLOCK_Spi0     = CLK_GATE_DEFINE(0x103CU, 12U),
    kCLOCK_Pdb1     = CLK_GATE_DEFINE(0x103CU, 17U),
    kCLOCK_Crc0     = CLK_GATE_DEFINE(0x103CU, 18U),
    kCLOCK_Pdb0     = CLK_GATE_DEFINE(0x103CU, 22U),
    kCLOCK_Pit0     = CLK_GATE_DEFINE(0x103CU, 23U),
    kCLOCK_Ftm0     = CLK_GATE_DEFINE(0x103CU, 24U),
    kCLOCK_Ftm1     = CLK_GATE_DEFINE(0x103CU, 25U),
    kCLOCK_Dac0     = CLK_GATE_DEFINE(0x103CU, 31U),

    kCLOCK_Dma0 = CLK_GATE_DEFINE(0x1040U, 8U),
} clock_ip_name_t;

/*!@brief SIM configuration structure for clock setting. */
typedef struct _sim_clock_config
{
    uint8_t er32kSrc; /*!< ERCLK32K source selection.   */
    uint32_t clkdiv1; /*!< SIM_CLKDIV1.                 */
} sim_clock_config_t;

